- 문제 (결측치 제거 및 그룹 합계)
    - f1 칼럼의 결측 데이터 제거
    - city 와 f2 를 기준으로 묶고 합계 구하기
    - 이때, city == '경기' and f2 == 0 인 조건에 만족하는 f1 구하기

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r'C:\Project\study-bigbungi\데이터\Basic\basic1.csv')
df.head(2)

     id  age city    f1  f2   f3    f4         f5
0  id01  2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02  9.0   서울  70.0   1  NaN  ENFJ  60.339826

In [3]:
df.isnull().sum()

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

In [4]:
print(df.shape)
df = df[~df['f1'].isnull()]
print(df.shape)

(100, 8)
(69, 8)

In [8]:
groupsum = df.groupby(['city', 'f2']).sum()
groupsum # type = pd

C:\Users\반소희\AppData\Local\Temp\ipykernel_18100\1533924658.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groupsum = df.groupby(['city', 'f2']).sum()

           age     f1          f5
city f2
경기   0   720.4  833.0  943.944823
     1   696.0  670.0  657.241212
     2   239.0  311.0  362.300060
대구   0   387.0  527.0  183.199568
     1   217.6  235.0  241.333824
     2   140.0  211.0   79.667919
부산   0   331.0  389.0  284.371097
     1   188.7  315.0  299.270973
     2   -13.5   47.0   67.886373
서울   0   145.0  278.0  218.528577
     1   315.3  534.0  438.485010
     2    68.3  207.0  126.661135

In [10]:
groupsum.iloc[0]['f1']

833.0